averyizatt/ESP32CanBusAutomotiveDataLogger/ESP32CanBus/ESP32S3_CANOnly/ESP32S3_CANOnly.ino
/*
  ESP32-S3 CAN-only Web UI

  - CAN via MCP2515 (mcp_can)
  - No SD card
  - No GPS
  - Web UI served from SPIFFS
  - WebSocket broadcast for live frames

  Target: ESP32-S3 DevKit
*/

// Arduino IDE note:
// If you copy/paste this file into a single .ino, the Arduino build system
// auto-generates function prototypes after the last #include line. Those
// prototypes can reference our structs (LogicalInput / EspNowCanPacket, etc)
// before they are defined. These forward declarations keep that build path
// working.
struct LogicalInput;
struct InputDef;
struct LogicalOutput;
struct EspNowCanPacket;

#include <Arduino.h>
#include <SPI.h>
#include <mcp_can.h>
#include <Wire.h>

// Types used throughout the sketch.
// These are kept in this file (not a separate header) so the code can be
// copy/pasted into an Arduino sketch without missing local includes.
struct LogicalInput {
  int gpio;        // ESP32 GPIO number, or -1 for unused
  bool activeLow;  // true if pressed/active pulls low (use pull-up)
};

struct InputDef {
  const char *label;
  int gpio;
  bool activeLow;
};

struct LogicalOutput {
  int gpio;           // ESP32 GPIO number, or -1 for unused
  bool activeHigh;    // true if output ON means drive HIGH
  bool pwmCapable;    // reserved for future PWM support
  uint16_t offset;    // table offset where the source byte lives
  uint8_t bit;        // which bit in that byte
};

#include <SD.h>
#include <time.h>

#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"

#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <WebServer.h>
#include <ESPmDNS.h>
#include <Update.h>
#include <ArduinoJson.h>
#include <SPIFFS.h>
#include <WebSocketsServer.h>

#include <esp_system.h>
#include <esp_idf_version.h>
#include <esp_task_wdt.h>

// If USB CDC is supported/enabled, allow runtime init so you can get logs
// over the same USB port you use for flashing.
#if defined(CONFIG_TINYUSB_CDC_ENABLED) && CONFIG_TINYUSB_CDC_ENABLED
#include "USB.h"
#define HAS_USB_CDC 1
#else
#define HAS_USB_CDC 0
#endif

// ------------------------------
// Serial debugging
// ------------------------------
// 0 = off, 1 = basic, 2 = verbose
#ifndef DEBUG_SERIAL_LEVEL
#define DEBUG_SERIAL_LEVEL 2
#endif

// Per-frame logging is VERY noisy and will reduce performance.
#ifndef DEBUG_SERIAL_FRAMES
#define DEBUG_SERIAL_FRAMES 0
#endif

static unsigned long dbgLastStatusMs = 0;
static unsigned long dbgLastWifiStateMs = 0;
static wl_status_t dbgLastWifiStatus = WL_IDLE_STATUS;
static bool dbgLastCanOk = false;

// Mirror debug prints to both UART Serial and USB CDC (when available).
class DualPrint : public Print {
public:
  Print *a = nullptr;
  Print *b = nullptr;

  size_t write(uint8_t c) override {
    size_t wrote = 0;
    if (a) wrote |= (a->write(c) == 1);
    if (b) wrote |= (b->write(c) == 1);
    return wrote ? 1 : 0;
  }

  size_t write(const uint8_t *buffer, size_t size) override {
    size_t wa = 0, wb = 0;
    if (a) wa = a->write(buffer, size);
    if (b) wb = b->write(buffer, size);
    return (wa > wb) ? wa : wb;
  }
};

static DualPrint DBG;

// ------------------------------
// Robustness / harsh automotive hardening
// ------------------------------
// Watchdog: resets MCU if loop hangs (EMI, stack, WiFi driver lockups, etc)
static const int WDT_TIMEOUT_S = 5;
static bool wdtEnabled = false;

static inline void feedWdt() {
  if (wdtEnabled) esp_task_wdt_reset();
}

// Boot-loop safe mode: if we reboot repeatedly before the system is stable,
// start in a reduced-feature mode to make recovery easier.
// RTC memory survives warm resets without flash wear.
RTC_DATA_ATTR static uint32_t bootFailCount = 0;
static bool SAFE_MODE = false;
static const uint32_t SAFE_MODE_BOOT_THRESHOLD = 4; // N quick-fail boots => SAFE_MODE

static const unsigned long WIFI_RECONNECT_INTERVAL_MS = 8000;
static unsigned long wifiLastReconnectMs = 0;

static const unsigned long CAN_REINIT_INTERVAL_MS = 2000;
static unsigned long canLastReinitAttemptMs = 0;
static byte canSendFailStreak = 0;
static const byte CAN_SEND_FAIL_STREAK_MAX = 10;

static const char* resetReasonStr(esp_reset_reason_t r) {
  switch (r) {
    case ESP_RST_UNKNOWN: return "UNKNOWN";
    case ESP_RST_POWERON: return "POWERON";
    case ESP_RST_EXT: return "EXT";
    case ESP_RST_SW: return "SW";
    case ESP_RST_PANIC: return "PANIC";
    case ESP_RST_INT_WDT: return "INT_WDT";
    case ESP_RST_TASK_WDT: return "TASK_WDT";
    case ESP_RST_WDT: return "WDT";
    case ESP_RST_DEEPSLEEP: return "DEEPSLEEP";
    case ESP_RST_BROWNOUT: return "BROWNOUT";
    case ESP_RST_SDIO: return "SDIO";
    default: return "?";
  }
}

static void initWdt() {
  // IDF v5+ supports esp_task_wdt_config_t; older IDF uses a simpler init call.
#if defined(ESP_IDF_VERSION_MAJOR) && (ESP_IDF_VERSION_MAJOR >= 5)
  esp_task_wdt_config_t cfg = {
    .timeout_ms = (uint32_t)(WDT_TIMEOUT_S * 1000),
    .idle_core_mask = 0,
    .trigger_panic = true,
  };
  if (esp_task_wdt_init(&cfg) == ESP_OK) {
    esp_task_wdt_add(NULL);
    wdtEnabled = true;
  }
#else
  if (esp_task_wdt_init((uint32_t)WDT_TIMEOUT_S, true) == ESP_OK) {
    esp_task_wdt_add(NULL);
    wdtEnabled = true;
  }
#endif
}

static void dbgPrintHexByte(uint8_t b) {
  if (b < 16) DBG.print('0');
  DBG.print(b, HEX);
}

static void dbgPrintCanFrame(unsigned long id, byte len, const byte *buf) {
  DBG.print("CAN rx id=0x");
  DBG.print(id, HEX);
  DBG.print(" len=");
  DBG.print((int)len);
  DBG.print(" data=");
  for (int i = 0; i < (int)len; ++i) {
    dbgPrintHexByte(buf[i]);
    if (i + 1 < (int)len) DBG.print(' ');
  }
  DBG.println();
}

// Optional I2C display (recommended: SSD1306 128x32/64).
// If you don't have these libraries installed, set to 0.
#define ENABLE_I2C_DISPLAY 1

#if ENABLE_I2C_DISPLAY
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#endif

// ------------------------------
// Pins (ESP32-S3)
// ------------------------------
static const int I2C_SDA = 3;
static const int I2C_SCL = 10;

