averyizatt/ESP32CanBusAutomotiveDataLogger/ESP32CanBus/ESP32S3_CANOnly/ESP32S3_CANOnly.ino
static const int CAN_INT = 37;
static const int CAN_SCK = 47;
static const int CAN_MOSI = 21; // SI
static const int CAN_MISO = 36; // SO
static const int CAN_CS  = 38;

// SD logging (shares the same SPI bus as the MCP2515 by default).
// NOTE: Most microSD modules are SPI, not I2C. If your module is truly I2C-based,
// tell me the exact module/chip so we can use the correct library.
#ifndef ENABLE_SD_LOGGING
#define ENABLE_SD_LOGGING 1
#endif

// Pick a free GPIO for your SD module CS.
// This must NOT conflict with CAN_CS or your inputs.
#ifndef SD_CS_PIN
#define SD_CS_PIN 14
#endif

static const int SD_CS = SD_CS_PIN;

// SPI bring-up: start conservative for noisy wiring, then raise after init.
static const uint32_t SPI_BAUD_INIT = 1000000;  // 1 MHz
static const uint32_t SPI_BAUD_RUN  = 8000000;  // 8 MHz

// Optional onboard RGB LED (WS2812-style). Many ESP32-S3 devkits use GPIO48.
// If your board differs, set this to your LED GPIO.
#ifndef STATUS_LED_PIN
#if defined(RGB_BUILTIN)
#define STATUS_LED_PIN RGB_BUILTIN
#else
#define STATUS_LED_PIN 48
#endif
#endif

// ------------------------------
// CAN
// ------------------------------
MCP_CAN CAN_MICRO(CAN_CS);
static bool CANOK = false;
static unsigned long lastCanMsg = 0;
static const unsigned long canTimeoutMs = 1500;
static unsigned long canCount = 0;

// MCP2515 specifics (your board: 8MHz oscillator)
static const uint8_t MCP_CLOCK = MCP_8MHZ;
static const uint8_t CAN_BITRATE = CAN_500KBPS;

// ------------------------------
// SD logging (non-blocking writer task)
// ------------------------------
static File logFile;
static bool SDOK = false;

static QueueHandle_t sdQueue = NULL;
static const int SD_QUEUE_SIZE = 64;
static String sdLogPath;

static bool timeValid = false;

static unsigned long getTimeSeconds() {
  if (timeValid) {
    time_t now = time(nullptr);
    if ((uint32_t)now > 1700000000UL) return (unsigned long)now;
  }
  return millis() / 1000;
}

static int monthFromName(const char *mon) {
  if (!mon) return 1;
  if (!strncmp(mon, "Jan", 3)) return 1;
  if (!strncmp(mon, "Feb", 3)) return 2;
  if (!strncmp(mon, "Mar", 3)) return 3;
  if (!strncmp(mon, "Apr", 3)) return 4;
  if (!strncmp(mon, "May", 3)) return 5;
  if (!strncmp(mon, "Jun", 3)) return 6;
  if (!strncmp(mon, "Jul", 3)) return 7;
  if (!strncmp(mon, "Aug", 3)) return 8;
  if (!strncmp(mon, "Sep", 3)) return 9;
  if (!strncmp(mon, "Oct", 3)) return 10;
  if (!strncmp(mon, "Nov", 3)) return 11;
  if (!strncmp(mon, "Dec", 3)) return 12;
  return 1;
}

static String nextTripPath() {
  // Prefer SNTP time when available; fall back to build date to avoid 1970.
  time_t secs = 0;
  time_t now = time(nullptr);
  if ((uint32_t)now > 1700000000UL) {
    secs = now;
    timeValid = true;
  } else {
    const char *bd = __DATE__; // "Mmm dd yyyy"
    char mon[4] = {0};
    int day = 1;
    int year = 1970;
    if (sscanf(bd, "%3s %d %d", mon, &day, &year) >= 3) {
      struct tm bt;
      memset(&bt, 0, sizeof(bt));
      bt.tm_year = year - 1900;
      bt.tm_mon = monthFromName(mon) - 1;
      bt.tm_mday = day;
      bt.tm_hour = 0;
      bt.tm_min = 0;
      bt.tm_sec = 0;
      secs = mktime(&bt);
    } else {
      secs = (time_t)(millis() / 1000);
    }
  }

  struct tm t;
  gmtime_r(&secs, &t);
  char dateDir[32];
  snprintf(dateDir, sizeof(dateDir), "/logs/%04d-%02d-%02d", t.tm_year + 1900, t.tm_mon + 1, t.tm_mday);

  if (!SD.exists("/logs")) SD.mkdir("/logs");
  if (!SD.exists(dateDir)) SD.mkdir(dateDir);

  for (int n = 1; n < 1000; ++n) {
    char fname[64];
    snprintf(fname, sizeof(fname), "%s/trip%03d.csv", dateDir, n);
    if (!SD.exists(String(fname))) return String(fname);
  }
  return String(dateDir) + String("/trip999.csv");
}

static void startNewTrip() {
  sdLogPath = nextTripPath();
  DBG.print("Opening log file: ");
  DBG.println(sdLogPath);
  logFile = SD.open(sdLogPath, FILE_WRITE);
  if (logFile) {
    logFile.println("type,ts,ms,a,b,c,d,e,f");
    logFile.flush();
  } else {
    DBG.println("Failed to open log file");
  }
}

static void sdEnqueueLog(const String &line) {
  if (!SDOK || !sdQueue) return;
  char *buf = (char *)malloc(line.length() + 1);
  if (!buf) return;
  strcpy(buf, line.c_str());
  if (xQueueSend(sdQueue, &buf, 0) != pdTRUE) {
    char *old;
    if (xQueueReceive(sdQueue, &old, 0) == pdTRUE) free(old);
    xQueueSend(sdQueue, &buf, 0);
  }
}

static void sdWriterTask(void *pvParameters) {
  (void)pvParameters;
  for (;;) {
    char *buf = NULL;
    if (xQueueReceive(sdQueue, &buf, portMAX_DELAY) == pdTRUE) {
      if (buf) {
        if (!logFile) {
          if (sdLogPath.length() == 0) sdLogPath = nextTripPath();
          logFile = SD.open(sdLogPath, FILE_WRITE);
          if (logFile) {
            logFile.println("type,ts,ms,a,b,c,d,e,f");
          }
        }
        if (logFile) {
          logFile.println((const char *)buf);
          logFile.flush();
        }
        free(buf);
      }
    }
  }
}

static void appendFilesInDir(const String &path, String &out) {
  File dir = SD.open(path);
  if (!dir) return;
  File entry = dir.openNextFile();
  while (entry) {
    String name = String(entry.name());
    if (entry.isDirectory()) {
      appendFilesInDir(name, out);
    } else {
      String n = name;
      if (n.startsWith("/")) n = n.substring(1);
      out += n + "\n";
    }
    entry.close();
    entry = dir.openNextFile();
  }
  dir.close();
}

// ------------------------------
// Microsquirt CAN expansion (remote table write, no ACK/handshake)
//
// MANDATORY frame format (per your spec):
//   CAN ID: 5 (11-bit)
//   DLC: 8
//   [0]=table (7)
//   [1]=off_hi (0)
//   [2]=off_lo (75)
//   [3]=port1 bits
//   [4]=port2 bits
//   [5]=port3 bits
//   [6]=0
//   [7]=0
static const uint16_t MICRO_CAN_ID = 5;
static const uint8_t MICRO_TABLE = 7;
static const uint16_t MICRO_OFFSET = 75;

// Push rate: 20–50 Hz (default 50 Hz)
static const uint32_t INPUT_PUSH_INTERVAL_MS = 20;

// ------------------------------
// User inputs (debounced)
// ------------------------------
// b* are momentary push buttons pulling GPIO to GND
// sw* are SPDT switches pulling GPIO to GND
static const uint32_t INPUT_DEBOUNCE_MS = 25;

static const InputDef USER_INPUTS[] = {
  {"B1", 4, true},
  {"B2", 5, true},
  {"B3", 6, true},
  {"SW1", 7, true},
  {"SW2", 15, true},
  {"SW3", 16, true},
};

