averyizatt/ESP32CanBusAutomotiveDataLogger/ESP32CanBus/ESP32S3_CANOnly/ESP32S3_CANOnly.ino
static const size_t USER_INPUTS_N = sizeof(USER_INPUTS) / sizeof(USER_INPUTS[0]);
static bool inputStableActive[USER_INPUTS_N] = {0};
static bool inputPrevRawActive[USER_INPUTS_N] = {0};
static unsigned long inputPrevRawMs[USER_INPUTS_N] = {0};

static int findUserInputIndexByGpio(int gpio) {
  for (size_t i = 0; i < USER_INPUTS_N; ++i) {
    if (USER_INPUTS[i].gpio == gpio) return (int)i;
  }
  return -1;
}

static bool readActiveFromGpio(int gpio, bool activeLow) {
  if (gpio < 0) return false;
  int v = digitalRead(gpio);
  bool active = (v != 0);
  if (activeLow) active = !active;
  return active;
}

static void pollUserInputs(unsigned long nowMs) {
  for (size_t i = 0; i < USER_INPUTS_N; ++i) {
    bool rawActive = readActiveFromGpio(USER_INPUTS[i].gpio, USER_INPUTS[i].activeLow);
    if (rawActive != inputPrevRawActive[i]) {
      inputPrevRawActive[i] = rawActive;
      inputPrevRawMs[i] = nowMs;
    }
    if ((nowMs - inputPrevRawMs[i]) >= INPUT_DEBOUNCE_MS) {
      if (rawActive != inputStableActive[i]) {
        inputStableActive[i] = rawActive;
#if DEBUG_SERIAL_LEVEL > 0
        DBG.print("INPUT ");
        DBG.print(USER_INPUTS[i].label);
        DBG.print(" (GPIO");
        DBG.print(USER_INPUTS[i].gpio);
        DBG.print(") = ");
        DBG.println(inputStableActive[i] ? "ON" : "OFF");
#endif

#if ENABLE_SD_LOGGING
        if (SDOK) {
          String line;
          line.reserve(96);
          line += "I,";
          line += String(getTimeSeconds());
          line += ",";
          line += String(nowMs);
          line += ",";
          line += USER_INPUTS[i].label;
          line += ",";
          line += (inputStableActive[i] ? "1" : "0");
          sdEnqueueLog(line);
        }
#endif
      }
    }
  }
}

// Map ESP32 GPIOs to logical inputs (Port 1..3, Bits 0..7).
// GPIO numbers never appear on CAN; only packed bitfields are sent.
// Set gpio=-1 to leave unused.
static const LogicalInput PORT1_MAP[8] = {
  // Inputs are active-low (wired to pull GPIO to GND), so we use INPUT_PULLUP.
  /*b0*/ {4, true},   // b1
  /*b1*/ {5, true},   // b2
  /*b2*/ {6, true},   // b3
  /*b3*/ {7, true},   // sw1
  /*b4*/ {15, true},  // sw2
  /*b5*/ {16, true},  // sw3
  /*b6*/ {-1, true},
  /*b7*/ {-1, true},
};

static const LogicalInput PORT2_MAP[8] = {
  /*b0*/ {-1, true},
  /*b1*/ {-1, true},
  /*b2*/ {-1, true},
  /*b3*/ {-1, true},
  /*b4*/ {-1, true},
  /*b5*/ {-1, true},
  /*b6*/ {-1, true},
  /*b7*/ {-1, true},
};

static const LogicalInput PORT3_MAP[8] = {
  /*b0*/ {-1, true},
  /*b1*/ {-1, true},
  /*b2*/ {-1, true},
  /*b3*/ {-1, true},
  /*b4*/ {-1, true},
  /*b5*/ {-1, true},
  /*b6*/ {-1, true},
  /*b7*/ {-1, true},
};

static unsigned long lastInputPushMs = 0;
static unsigned long inputPushCount = 0;
static byte lastPort1 = 0;
static byte lastPort2 = 0;
static byte lastPort3 = 0;
static byte lastInputPushRc = 255;

static void configureLogicalInputs() {
  auto cfgOne = [](const LogicalInput &li) {
    if (li.gpio < 0) return;
    // Prefer internal pulls to keep wiring simple.
    if (li.activeLow) pinMode(li.gpio, INPUT_PULLUP);
    else pinMode(li.gpio, INPUT_PULLDOWN);
  };
  for (int i = 0; i < 8; ++i) cfgOne(PORT1_MAP[i]);
  for (int i = 0; i < 8; ++i) cfgOne(PORT2_MAP[i]);
  for (int i = 0; i < 8; ++i) cfgOne(PORT3_MAP[i]);
}

static bool readLogicalInput(const LogicalInput &li) {
  if (li.gpio < 0) return false;

  // If this gpio is one of the user-mapped inputs, use the debounced state.
  int idx = findUserInputIndexByGpio(li.gpio);
  if (idx >= 0) return inputStableActive[(size_t)idx];

  return readActiveFromGpio(li.gpio, li.activeLow);
}

static byte packPortByte(const LogicalInput portMap[8]) {
  byte out = 0;
  for (int bit = 0; bit < 8; ++bit) {
    if (readLogicalInput(portMap[bit])) out |= (1U << bit);
  }
  return out;
}

static void pushMicrosquirtInputsIfDue() {
  unsigned long now = millis();
  if (now - lastInputPushMs < INPUT_PUSH_INTERVAL_MS) return;
  lastInputPushMs = now;

  lastPort1 = packPortByte(PORT1_MAP);
  lastPort2 = packPortByte(PORT2_MAP);
  lastPort3 = packPortByte(PORT3_MAP);

  byte out[8] = {0};
  out[0] = MICRO_TABLE;
  out[1] = (byte)(MICRO_OFFSET >> 8);
  out[2] = (byte)(MICRO_OFFSET & 0xFF);
  out[3] = lastPort1;
  out[4] = lastPort2;
  out[5] = lastPort3;
  out[6] = 0;
  out[7] = 0;

  lastInputPushRc = CAN_MICRO.sendMsgBuf(MICRO_CAN_ID, 0, 8, out);
  if (lastInputPushRc == CAN_OK) {
    canSendFailStreak = 0;
    // Treat successful TX as "CAN alive" even if the bus is otherwise quiet.
    lastCanMsg = now;
  } else {
    if (canSendFailStreak < 255) canSendFailStreak++;
  }
  inputPushCount++;

#if ENABLE_SD_LOGGING
  // Periodic summary logging (1 Hz) so we can reconstruct state without logging every frame.
  static unsigned long sdLastSummaryMs = 0;
  if (SDOK && (now - sdLastSummaryMs) >= 1000UL) {
    sdLastSummaryMs = now;
    String line;
    line.reserve(128);
    line += "S,";
    line += String(getTimeSeconds());
    line += ",";
    line += String(now);
    line += ",rx=";
    line += String((unsigned long)canCount);
    line += ",push=";
    line += String((unsigned long)inputPushCount);
    line += ",rc=";
    line += String((int)lastInputPushRc);
    line += ",P1=0x";
    line += String(lastPort1, HEX);
    line += ",P2=0x";
    line += String(lastPort2, HEX);
    line += ",P3=0x";
    line += String(lastPort3, HEX);
    sdEnqueueLog(line);
  }
#endif
}

static bool initCanController(bool verbose) {
  if (verbose) Serial.println("CAN: initializing MCP2515...");
  bool ok = (CAN_MICRO.begin(MCP_ANY, CAN_BITRATE, MCP_CLOCK) == CAN_OK);
  if (ok) {
    CAN_MICRO.setMode(MCP_NORMAL);
    if (verbose) Serial.println("CAN: init OK");
  } else {
    if (verbose) Serial.println("CAN: init FAIL");
  }
  return ok;
}

static uint8_t mcp2515ReadReg(uint8_t reg, uint8_t spiMode) {
  SPI.beginTransaction(SPISettings(SPI_BAUD_INIT, MSBFIRST, spiMode));
  digitalWrite(CAN_CS, LOW);
  SPI.transfer(0x03); // READ
  SPI.transfer(reg);
  uint8_t v = SPI.transfer(0x00);
  digitalWrite(CAN_CS, HIGH);
  SPI.endTransaction();
  return v;
}

