averyizatt/ESP32CanBusAutomotiveDataLogger/ESP32CanBus/ESP32S3_CANOnly/ESP32S3_CANOnly.ino
static void mcp2515Reset() {
  SPI.beginTransaction(SPISettings(SPI_BAUD_INIT, MSBFIRST, SPI_MODE0));
  digitalWrite(CAN_CS, LOW);
  SPI.transfer(0xC0); // RESET
  digitalWrite(CAN_CS, HIGH);
  SPI.endTransaction();
  delay(10);
}

static void probeMcp2515Once() {
#if DEBUG_SERIAL_LEVEL > 0
  // CANSTAT=0x0E, CANCTRL=0x0F. After reset, CANSTAT opmode bits usually show CONFIG (0x80).
  DBG.println("MCP2515 probe (SPI READ regs):");
  uint8_t canstat_m0 = mcp2515ReadReg(0x0E, SPI_MODE0);
  uint8_t canctrl_m0 = mcp2515ReadReg(0x0F, SPI_MODE0);
  DBG.print("  MODE0 CANSTAT=0x"); dbgPrintHexByte(canstat_m0);
  DBG.print(" CANCTRL=0x"); dbgPrintHexByte(canctrl_m0);
  DBG.println();

  uint8_t canstat_m3 = mcp2515ReadReg(0x0E, SPI_MODE3);
  uint8_t canctrl_m3 = mcp2515ReadReg(0x0F, SPI_MODE3);
  DBG.print("  MODE3 CANSTAT=0x"); dbgPrintHexByte(canstat_m3);
  DBG.print(" CANCTRL=0x"); dbgPrintHexByte(canctrl_m3);
  DBG.println();

  DBG.println("  Sending MCP2515 RESET...");
  mcp2515Reset();
  uint8_t canstat2 = mcp2515ReadReg(0x0E, SPI_MODE0);
  uint8_t canctrl2 = mcp2515ReadReg(0x0F, SPI_MODE0);
  DBG.print("  After reset CANSTAT=0x"); dbgPrintHexByte(canstat2);
  DBG.print(" CANCTRL=0x"); dbgPrintHexByte(canctrl2);
  DBG.println();

  if (canstat2 == 0x00 || canstat2 == 0xFF) {
    DBG.println("  PROBE WARNING: MCP2515 may not be responding (wiring/power/pins). ");
    DBG.println("  Check: 3.3V+GND, CS pin, SCK/MOSI/MISO, and module actually uses MCP2515.");
  }
#endif
}

static void maybeRecoverCan(unsigned long now) {
  if (SAFE_MODE) return;

  bool timedOut = (now - lastCanMsg) > canTimeoutMs;
  bool txFailing = (canSendFailStreak >= CAN_SEND_FAIL_STREAK_MAX);
  if (!timedOut && !txFailing) return;
  if (now - canLastReinitAttemptMs < CAN_REINIT_INTERVAL_MS) return;
  canLastReinitAttemptMs = now;

#if DEBUG_SERIAL_LEVEL > 0
  Serial.print("CAN: recovery attempt, reason=");
  if (timedOut) Serial.print("timeout ");
  if (txFailing) Serial.print("tx_fail ");
  Serial.print(" ageMs="); Serial.print((unsigned long)(now - lastCanMsg));
  Serial.print(" txFailStreak="); Serial.println((int)canSendFailStreak);
#endif

  SPI.end();
  delay(10);
  SPI.begin(CAN_SCK, CAN_MISO, CAN_MOSI, CAN_CS);
  SPI.setFrequency(8000000);
  CANOK = initCanController(false);
  canSendFailStreak = 0;
}

static void maybeRecoverWifi(unsigned long now) {
  if (SAFE_MODE) return;
  if (WiFi.getMode() != WIFI_STA) return;
  if (WiFi.status() == WL_CONNECTED) return;
  if (now - wifiLastReconnectMs < WIFI_RECONNECT_INTERVAL_MS) return;
  wifiLastReconnectMs = now;

#if DEBUG_SERIAL_LEVEL > 0
  Serial.println("WiFi: reconnect attempt...");
#endif
  WiFi.disconnect(false);
  WiFi.reconnect();
}

static unsigned long lastFrameId = 0;
static byte lastFrameLen = 0;
static unsigned long lastFrameTs = 0;
static uint32_t drainedLastLoop = 0;

// Mirror of Microsquirt remote table 7 writes observed on the bus.
// This is used for debugging now and for output decoding later.
static const size_t MS_TABLE7_SIZE = 128;
static uint8_t msTable7Mirror[MS_TABLE7_SIZE] = {0};
static unsigned long msTable7RxCount = 0;
static unsigned long msTable7LastRxMs = 0;
static uint16_t msTable7LastOffset = 0;
static byte msTable7LastPayload[5] = {0};

static const LogicalOutput OUTPUTS_DIGITAL[] = {
  // Example placeholders (disabled): set gpio/offset/bit when ready.
  // {gpio, activeHigh, pwmCapable, offset, bit}
  {-1, true, false, 0, 0},
};

static void configureLogicalOutputs() {
  // Safe default: nothing configured until you assign gpios.
  for (size_t i = 0; i < (sizeof(OUTPUTS_DIGITAL) / sizeof(OUTPUTS_DIGITAL[0])); ++i) {
    if (OUTPUTS_DIGITAL[i].gpio < 0) continue;
    pinMode(OUTPUTS_DIGITAL[i].gpio, OUTPUTS_DIGITAL[i].activeHigh ? OUTPUT : OUTPUT);
    digitalWrite(OUTPUTS_DIGITAL[i].gpio, OUTPUTS_DIGITAL[i].activeHigh ? LOW : HIGH);
  }
}

static void applyLogicalOutputsFromMirror() {
  // Safe default: do nothing unless outputs are configured.
  for (size_t i = 0; i < (sizeof(OUTPUTS_DIGITAL) / sizeof(OUTPUTS_DIGITAL[0])); ++i) {
    const LogicalOutput &o = OUTPUTS_DIGITAL[i];
    if (o.gpio < 0) continue;
    if (o.offset >= MS_TABLE7_SIZE) continue;
    bool on = ((msTable7Mirror[o.offset] >> o.bit) & 0x01) != 0;
    if (!o.activeHigh) on = !on;
    digitalWrite(o.gpio, on ? HIGH : LOW);
  }
}

static void handleMicrosquirtTable7WriteFrame(unsigned long canId, byte len, const byte *buf) {
  // Microsquirt remote table write frames (observed on bus)
  // ID: 5, DLC: 8, [0]=table, [1]=off_hi, [2]=off_lo, [3..7]=payload bytes
  if (canId != MICRO_CAN_ID) return;
  if (len != 8) return;
  if (buf[0] != MICRO_TABLE) return;

  uint16_t off = (uint16_t)((buf[1] << 8) | buf[2]);
  msTable7LastOffset = off;
  for (int i = 0; i < 5; ++i) msTable7LastPayload[i] = buf[3 + i];

  // Mirror the 5 payload bytes into our local table image.
  for (int i = 0; i < 5; ++i) {
    uint16_t idx = (uint16_t)(off + i);
    if (idx < MS_TABLE7_SIZE) msTable7Mirror[idx] = buf[3 + i];
  }

  msTable7RxCount++;
  msTable7LastRxMs = millis();

  // Future outputs: if ECU writes output bytes into table 7, we can decode from mirror.
  applyLogicalOutputsFromMirror();
}

// Performance knobs
static const uint32_t CAN_DRAIN_MAX_PER_LOOP = 64;
static const uint32_t WS_BATCH_MAX = 10;
static const uint32_t WS_PUSH_INTERVAL_MS = 25; // ~40 Hz UI updates

// ------------------------------
// Recent frames ring buffer
// ------------------------------
#define MAX_FRAME_LIST 96
struct FrameRecord { unsigned long id; char data[80]; unsigned long ts; };
static FrameRecord framesBuf[MAX_FRAME_LIST];
static int framesHead = 0;
static unsigned long framesTotal = 0;

// Loop statistics
static unsigned long loopCount = 0;
static unsigned long loopRateHz = 0;
static unsigned long lastLoopRateSampleMs = 0;
static unsigned long lastLoopCountSample = 0;

static unsigned long getUptimeSeconds() {
  return millis() / 1000;
}

static void pushFrame(unsigned long id, const byte* buf, byte len) {
  int idx = framesHead % MAX_FRAME_LIST;
  framesBuf[idx].id = id;

  int p = 0;
  for (byte i = 0; i < len && p < (int)(sizeof(framesBuf[idx].data) - 4); ++i) {
    sprintf(&framesBuf[idx].data[p], "%02X ", buf[i]);
    p += 3;
  }
  if (p > 0 && p < (int)sizeof(framesBuf[idx].data)) {
    framesBuf[idx].data[p - 1] = '\0';
  } else {
    framesBuf[idx].data[min(p, (int)sizeof(framesBuf[idx].data) - 1)] = '\0';
  }

