averyizatt/ESP32CanBusAutomotiveDataLogger/ESP32CanBus/ESP32S3_CANOnly/ESP32S3_CANOnly.ino
  framesBuf[idx].ts = getUptimeSeconds();
  framesHead++;
  framesTotal++;
}

// ------------------------------
// Web / WiFi / SPIFFS
// ------------------------------
WebServer server(80);
WebSocketsServer webSocket(81);

static bool WIFIOK = false;
static String webURL;

// ------------------------------
// ESP-NOW (wireless sensor nodes -> CAN)
// ------------------------------
#ifndef ENABLE_ESPNOW
#define ENABLE_ESPNOW 1
#endif

static bool ESPNOW_OK = false;
static unsigned long espnowRxCount = 0;
static unsigned long espnowDropNotAllowed = 0;
static unsigned long espnowDropBadPacket = 0;
static unsigned long espnowForwardOk = 0;
static unsigned long espnowForwardFail = 0;
static unsigned long espnowLastRxMs = 0;
static uint8_t espnowLastMac[6] = {0};

// Allowlist: only MACs in this list are accepted.
// Stored in SPIFFS at /espnow_peers.json and configurable via HTTP endpoints.
// If empty AND ESPNOW_ALLOW_ALL_IF_EMPTY=1, all peers are accepted.
#ifndef ESPNOW_ALLOW_ALL_IF_EMPTY
#define ESPNOW_ALLOW_ALL_IF_EMPTY 0
#endif

static const char* espnowPeersFile = "/espnow_peers.json";
static const size_t ESPNOW_MAX_PEERS = 12;
static uint8_t espnowAllowedMacs[ESPNOW_MAX_PEERS][6];
static size_t espnowAllowedCount = 0;

static bool macEquals(const uint8_t a[6], const uint8_t b[6]) {
  for (int i = 0; i < 6; ++i) if (a[i] != b[i]) return false;
  return true;
}

static bool isMacAllowed(const uint8_t mac[6]) {
  if (espnowAllowedCount == 0) return (ESPNOW_ALLOW_ALL_IF_EMPTY != 0);
  for (size_t i = 0; i < espnowAllowedCount; ++i) {
    if (macEquals(espnowAllowedMacs[i], mac)) return true;
  }
  return false;
}

static String macToString(const uint8_t mac[6]) {
  char buf[18];
  snprintf(buf, sizeof(buf), "%02X:%02X:%02X:%02X:%02X:%02X",
           mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  return String(buf);
}

static bool parseMacString(const String &s, uint8_t out[6]) {
  // Accept AA:BB:CC:DD:EE:FF or AABBCCDDEEFF
  String t = s;
  t.trim();
  t.replace("-", "");
  t.replace(":", "");
  t.replace(" ", "");
  if (t.length() != 12) return false;
  auto hexVal = [](char c) -> int {
    if (c >= '0' && c <= '9') return c - '0';
    if (c >= 'A' && c <= 'F') return c - 'A' + 10;
    if (c >= 'a' && c <= 'f') return c - 'a' + 10;
    return -1;
  };
  for (int i = 0; i < 6; ++i) {
    int a = hexVal(t.charAt(i * 2));
    int b = hexVal(t.charAt(i * 2 + 1));
    if (a < 0 || b < 0) return false;
    out[i] = (uint8_t)((a << 4) | b);
  }
  return true;
}

static void ensureEspNowPeersFileExists() {
  if (SPIFFS.exists(espnowPeersFile)) return;
  File f = SPIFFS.open(espnowPeersFile, FILE_WRITE);
  if (!f) return;
  f.print("{\"peers\":[]}");
  f.close();
}

static bool saveEspNowPeersToSpiffs() {
  StaticJsonDocument<512> doc;
  JsonArray arr = doc.createNestedArray("peers");
  for (size_t i = 0; i < espnowAllowedCount; ++i) {
    arr.add(macToString(espnowAllowedMacs[i]));
  }
  File f = SPIFFS.open(espnowPeersFile, FILE_WRITE);
  if (!f) return false;
  serializeJson(doc, f);
  f.close();
  return true;
}

static void refreshEspNowPeersInDriver() {
  if (!ESPNOW_OK) return;
  // Add configured peers into esp-now driver so we can later support outbound ACKs/encryption.
  // Receiving still uses our allowlist filter.
  for (size_t i = 0; i < espnowAllowedCount; ++i) {
    esp_now_peer_info_t peer;
    memset(&peer, 0, sizeof(peer));
    memcpy(peer.peer_addr, espnowAllowedMacs[i], 6);
    peer.channel = 0; // current channel
    peer.encrypt = false;
    esp_now_add_peer(&peer);
  }
}

static void loadEspNowPeersFromSpiffs() {
  ensureEspNowPeersFileExists();
  File f = SPIFFS.open(espnowPeersFile, FILE_READ);
  if (!f) return;

  StaticJsonDocument<768> doc;
  DeserializationError err = deserializeJson(doc, f);
  f.close();
  if (err) return;

  JsonArray arr = doc["peers"].as<JsonArray>();
  if (arr.isNull()) return;

  espnowAllowedCount = 0;
  for (JsonVariant v : arr) {
    if (espnowAllowedCount >= ESPNOW_MAX_PEERS) break;
    String s = v.as<String>();
    uint8_t mac[6];
    if (!parseMacString(s, mac)) continue;
    bool dup = false;
    for (size_t i = 0; i < espnowAllowedCount; ++i) {
      if (macEquals(espnowAllowedMacs[i], mac)) { dup = true; break; }
    }
    if (dup) continue;
    memcpy(espnowAllowedMacs[espnowAllowedCount++], mac, 6);
  }

  refreshEspNowPeersInDriver();
}

// Packet format: sender packs a CAN frame to forward.
// Keep this small + explicit so it’s easy to implement on other ESP32s.
struct EspNowCanPacket {
  uint32_t magic;   // 'C''A''N''1' = 0x314E4143
  uint8_t version;  // 1
  uint8_t ext;      // 0=11-bit, 1=29-bit
  uint8_t len;      // 0..8
  uint8_t reserved;
  uint32_t can_id;
  uint8_t data[8];
};

static const uint32_t ESPNOW_CAN_MAGIC = 0x314E4143UL;

// Queue to move work out of the WiFi/ESP-NOW callback context.
static const uint8_t ESPNOW_Q_SIZE = 16;
static EspNowCanPacket espnowQ[ESPNOW_Q_SIZE];
static volatile uint8_t espnowQHead = 0;
static volatile uint8_t espnowQTail = 0;
static portMUX_TYPE espnowQMutex = portMUX_INITIALIZER_UNLOCKED;

static bool espnowQueuePush(const EspNowCanPacket &pkt) {
  bool ok = false;
  portENTER_CRITICAL(&espnowQMutex);
  uint8_t next = (uint8_t)((espnowQHead + 1) % ESPNOW_Q_SIZE);
  if (next != espnowQTail) {
    espnowQ[espnowQHead] = pkt;
    espnowQHead = next;
    ok = true;
  }
  portEXIT_CRITICAL(&espnowQMutex);
  return ok;
}

static bool espnowQueuePop(EspNowCanPacket &out) {
  bool ok = false;
  portENTER_CRITICAL(&espnowQMutex);
  if (espnowQTail != espnowQHead) {
    out = espnowQ[espnowQTail];
    espnowQTail = (uint8_t)((espnowQTail + 1) % ESPNOW_Q_SIZE);
    ok = true;
  }
  portEXIT_CRITICAL(&espnowQMutex);
  return ok;
}

// ESP-NOW recv callback signature differs between Arduino-ESP32 core generations.
#if defined(ESP_IDF_VERSION_MAJOR) && (ESP_IDF_VERSION_MAJOR >= 5)
static void onEspNowRecv(const esp_now_recv_info_t *info, const uint8_t *data, int len) {
  if (!info || !data || len <= 0) return;
  const uint8_t *src = info->src_addr;
  espnowRxCount++;
  espnowLastRxMs = millis();
  memcpy(espnowLastMac, src, 6);

  if (!isMacAllowed(src)) {
    espnowDropNotAllowed++;
    return;
  }

  if (len < (int)sizeof(EspNowCanPacket)) { espnowDropBadPacket++; return; }
  EspNowCanPacket pkt;
  memcpy(&pkt, data, sizeof(pkt));
  if (pkt.magic != ESPNOW_CAN_MAGIC) { espnowDropBadPacket++; return; }
  if (pkt.version != 1) { espnowDropBadPacket++; return; }
  if (pkt.len > 8) { espnowDropBadPacket++; return; }
  if (!pkt.ext && (pkt.can_id > 0x7FFUL)) { espnowDropBadPacket++; return; }
  if (pkt.ext && (pkt.can_id > 0x1FFFFFFFUL)) { espnowDropBadPacket++; return; }

  (void)espnowQueuePush(pkt);
}
#else
static void onEspNowRecv(const uint8_t *src, const uint8_t *data, int len) {
  if (!src || !data || len <= 0) return;
  espnowRxCount++;
  espnowLastRxMs = millis();
  memcpy(espnowLastMac, src, 6);

  if (!isMacAllowed(src)) {
    espnowDropNotAllowed++;
    return;
  }

  if (len < (int)sizeof(EspNowCanPacket)) { espnowDropBadPacket++; return; }
  EspNowCanPacket pkt;
  memcpy(&pkt, data, sizeof(pkt));
  if (pkt.magic != ESPNOW_CAN_MAGIC) { espnowDropBadPacket++; return; }
  if (pkt.version != 1) { espnowDropBadPacket++; return; }
  if (pkt.len > 8) { espnowDropBadPacket++; return; }
  if (!pkt.ext && (pkt.can_id > 0x7FFUL)) { espnowDropBadPacket++; return; }
  if (pkt.ext && (pkt.can_id > 0x1FFFFFFFUL)) { espnowDropBadPacket++; return; }

  (void)espnowQueuePush(pkt);
}
#endif

static bool initEspNow() {
#if !ENABLE_ESPNOW
  return false;
#else
  // ESP-NOW requires WiFi to be initialized in STA/AP/AP+STA mode.
  // We keep it in STA mode initially; if we later start an AP for UI setup,
  // we use WIFI_AP_STA so ESP-NOW remains active.
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);

  // Ensure WiFi is started (esp_wifi is initialized by the Arduino WiFi lib).
  esp_err_t err = esp_now_init();
  if (err != ESP_OK) {
#if DEBUG_SERIAL_LEVEL > 0
    DBG.print("ESP-NOW init failed: ");
    DBG.println((int)err);
#endif
    return false;
  }

