averyizatt/ESP32CanBusAutomotiveDataLogger/ESP32CanBus/ESP32S3_CANOnly/ESP32S3_CANOnly.ino
  esp_now_register_recv_cb(onEspNowRecv);

#if DEBUG_SERIAL_LEVEL > 0
  DBG.println("ESP-NOW init OK (recv enabled)");
#endif
  return true;
#endif
}

static void drainEspNowToCan() {
#if ENABLE_ESPNOW
  if (!ESPNOW_OK) return;
  EspNowCanPacket pkt;
  while (espnowQueuePop(pkt)) {
    byte rc = CAN_MICRO.sendMsgBuf(pkt.can_id, pkt.ext ? 1 : 0, pkt.len, (byte *)pkt.data);
    if (rc == CAN_OK) espnowForwardOk++;
    else espnowForwardFail++;
  }
#endif
}

static unsigned long wsLastPushMs = 0;
static unsigned long wsFramesSincePush = 0;

static const String wifiFile = "/wifi.json";
static const String adminTokenFile = "/admin.token";

// derive simple XOR key from chip MAC
static void deriveKey(uint8_t *key, size_t len) {
  uint64_t mac = ESP.getEfuseMac();
  for (size_t i = 0; i < len; ++i) key[i] = (mac >> ((i % 8) * 8)) & 0xFF;
}

static String toHex(const uint8_t *data, size_t len) {
  String s;
  s.reserve(len * 2 + 1);
  const char hex[] = "0123456789ABCDEF";
  for (size_t i = 0; i < len; ++i) {
    s += hex[(data[i] >> 4) & 0x0F];
    s += hex[data[i] & 0x0F];
  }
  return s;
}

static size_t hexToBytes(const String &hex, uint8_t *out, size_t maxOut) {
  size_t hlen = hex.length();
  size_t cnt = 0;
  for (size_t i = 0; i + 1 < hlen && cnt < maxOut; i += 2) {
    char a = hex.charAt(i);
    char b = hex.charAt(i + 1);
    auto val = [](char c) -> int {
      if (c >= '0' && c <= '9') return c - '0';
      if (c >= 'A' && c <= 'F') return c - 'A' + 10;
      if (c >= 'a' && c <= 'f') return c - 'a' + 10;
      return 0;
    };
    out[cnt++] = (val(a) << 4) | val(b);
  }
  return cnt;
}

static String encryptString(const String &plain) {
  if (plain.length() == 0) return String("");
  size_t n = plain.length();
  uint8_t key[8];
  deriveKey(key, sizeof(key));
  uint8_t *buf = (uint8_t *)malloc(n);
  if (!buf) return String("");
  for (size_t i = 0; i < n; ++i) buf[i] = ((uint8_t)plain.charAt(i)) ^ key[i % 8];
  String h = toHex(buf, n);
  free(buf);
  return String("enc:") + h;
}

static String decryptString(const String &cipher) {
  if (!cipher.startsWith("enc:")) return cipher;
  String hex = cipher.substring(4);
  size_t hlen = hex.length() / 2;
  uint8_t *buf = (uint8_t *)malloc(hlen);
  if (!buf) return String("");
  size_t got = hexToBytes(hex, buf, hlen);
  uint8_t key[8];
  deriveKey(key, sizeof(key));
  String out;
  out.reserve(got + 1);
  for (size_t i = 0; i < got; ++i) out += (char)(buf[i] ^ key[i % 8]);
  free(buf);
  return out;
}

static void ensureWifiJsonExists() {
  if (SPIFFS.exists(wifiFile)) return;
  File f = SPIFFS.open(wifiFile, FILE_WRITE);
  if (!f) return;
  f.print("{\"networks\":[]}");
  f.close();
}

static void ensureAdminTokenExists() {
  if (SPIFFS.exists(adminTokenFile)) return;
  uint8_t t[16];
  for (int i = 0; i < 16; ++i) {
    uint32_t r = esp_random();
    t[i] = (r >> (8 * (i % 4))) & 0xFF;
  }
  String tok = toHex(t, 16);
  File f = SPIFFS.open(adminTokenFile, FILE_WRITE);
  if (f) {
    f.print(tok);
    f.close();
  }
}

static String readAdminToken() {
  if (!SPIFFS.exists(adminTokenFile)) return String("");
  File f = SPIFFS.open(adminTokenFile, FILE_READ);
  if (!f) return String("");
  String t;
  while (f.available()) t += (char)f.read();
  f.close();
  t.trim();
  return t;
}

static bool checkAuth() {
  String provided;
  if (server.hasHeader("X-Auth-Token")) provided = server.header("X-Auth-Token");
  else if (server.hasHeader("Authorization")) {
    String a = server.header("Authorization");
    if (a.startsWith("Bearer ")) provided = a.substring(7);
  }
  if (provided.length() == 0 && server.hasArg("token")) provided = server.arg("token");

  String real = readAdminToken();
  if (real.length() > 0 && provided.equals(real)) return true;

  // allow same /24 LAN without token
  IPAddress rem = server.client().remoteIP();
  IPAddress loc = WiFi.localIP();
  if (rem == IPAddress(0, 0, 0, 0) || rem == loc) return true;
  if (rem[0] == loc[0] && rem[1] == loc[1] && rem[2] == loc[2]) return true;

  return false;
}

static bool connectSavedNetworks() {
  ensureWifiJsonExists();
  File f = SPIFFS.open(wifiFile, FILE_READ);
  if (!f) return false;

  StaticJsonDocument<768> doc;
  DeserializationError err = deserializeJson(doc, f);
  f.close();
  if (err) return false;

  JsonArray arr = doc["networks"].as<JsonArray>();
  if (arr.isNull() || arr.size() == 0) return false;

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);

  for (JsonObject o : arr) {
    String ss = String((const char *)o["ssid"]);
    String pw = String((const char *)o["pass"]);
    pw = decryptString(pw);

    DBG.print("Trying WiFi: ");
    DBG.println(ss);

    WiFi.begin(ss.c_str(), pw.c_str());

    unsigned long start = millis();
    while (millis() - start < 9000) {
      if (WiFi.status() == WL_CONNECTED) {
        DBG.println("WiFi connected");
        DBG.println(WiFi.localIP());
        webURL = String("http://") + WiFi.localIP().toString();
        return true;
      }
      feedWdt();
      delay(150);
    }

    WiFi.disconnect(true);
    delay(200);
  }

  return false;
}

static void startAPMode() {
  // Keep STA enabled so ESP-NOW remains active while running AP.
  WiFi.mode(WIFI_AP_STA);
  WiFi.setSleep(false);
  WiFi.softAP("CAN-Expander", "password");
  IPAddress ip = WiFi.softAPIP();
  DBG.print("AP mode, IP: ");
  DBG.println(ip);
  webURL = String("http://") + ip.toString();
}

static String contentTypeForPath(const String &p) {
  if (p.endsWith(".html")) return "text/html";
  if (p.endsWith(".css")) return "text/css";
  if (p.endsWith(".js")) return "application/javascript";
  if (p.endsWith(".json")) return "application/json";
  if (p.endsWith(".svg")) return "image/svg+xml";
  if (p.endsWith(".png")) return "image/png";
  if (p.endsWith(".jpg") || p.endsWith(".jpeg")) return "image/jpeg";
  return "text/plain";
}

static bool serveSpiffsFile(String path) {
  if (path == "/") path = "/index.html";
  if (!SPIFFS.exists(path)) return false;

  File f = SPIFFS.open(path, FILE_READ);
  if (!f) return false;

