averyizatt/ESP32CanBusAutomotiveDataLogger/ESP32CanBus/ESP32S3_CANOnly/ESP32S3_CANOnly.ino
  server.streamFile(f, contentTypeForPath(path));
  f.close();
  return true;
}

static bool otaAuthorized = false;

static void handleRoot() {
  if (!serveSpiffsFile("/index.html")) server.send(404, "text/plain", "Not found");
}

static void handleGenericFile() {
  String path = server.uri();
  if (!serveSpiffsFile(path)) server.send(404, "text/plain", "Not found: " + path);
}

static void handleAddWiFi() {
  if (!checkAuth()) {
    server.send(401, "text/plain", "Unauthorized");
    return;
  }

  if (!server.hasArg("ssid") || !server.hasArg("pass")) {
    server.send(400, "text/plain", "Missing ssid/pass");
    return;
  }

  String ss = server.arg("ssid");
  String pw = server.arg("pass");

  ensureWifiJsonExists();

  File f = SPIFFS.open(wifiFile, FILE_READ);
  if (!f) {
    server.send(500, "text/plain", "Failed to open wifi.json");
    return;
  }

  StaticJsonDocument<768> doc;
  DeserializationError err = deserializeJson(doc, f);
  f.close();
  if (err) {
    server.send(500, "text/plain", "wifi.json parse error");
    return;
  }

  JsonArray arr = doc["networks"].as<JsonArray>();
  if (arr.isNull()) arr = doc.createNestedArray("networks");

  JsonObject obj = arr.createNestedObject();
  obj["ssid"] = ss;
  obj["pass"] = encryptString(pw);

  File w = SPIFFS.open(wifiFile, FILE_WRITE);
  if (!w) {
    server.send(500, "text/plain", "Failed to write wifi.json");
    return;
  }
  serializeJson(doc, w);
  w.close();

  server.sendHeader("Location", "/wifi.html", true);
  server.send(302, "text/plain", "OK");
}

static void handleOTAUpload() {
  HTTPUpload &up = server.upload();
  if (up.status == UPLOAD_FILE_START) {
    DBG.println("OTA: begin");
    otaAuthorized = checkAuth();
    if (!otaAuthorized) {
      DBG.println("OTA: unauthorized upload attempt");
      return;
    }
    if (!Update.begin()) DBG.println("OTA begin failed");
  } else if (up.status == UPLOAD_FILE_WRITE) {
    if (!otaAuthorized) return;
    if (Update.write(up.buf, up.currentSize) != up.currentSize) DBG.println("OTA write failed");
  } else if (up.status == UPLOAD_FILE_END) {
    if (!otaAuthorized) {
      DBG.println("OTA aborted: unauthorized");
      return;
    }
    if (Update.end(true)) DBG.println("OTA success, rebooting...");
    else DBG.println("OTA end failed");
  }
}

static void webSocketEvent(uint8_t num, WStype_t type, uint8_t * payload, size_t length) {
  (void)payload;
  (void)length;
  if (type == WStype_CONNECTED) {
    IPAddress ip = webSocket.remoteIP(num);
    DBG.print("WebSocket client connected: ");
    DBG.println(ip);
  }
}

static void wsBroadcast(String txt) {
  webSocket.broadcastTXT(txt);
}

static void setStatusLed(uint8_t r, uint8_t g, uint8_t b) {
#if (STATUS_LED_PIN >= 0)
  // neopixelWrite is provided by Arduino-ESP32 core for WS2812-style LEDs
  neopixelWrite(STATUS_LED_PIN, r, g, b);
#else
  (void)r; (void)g; (void)b;
#endif
}

static void updateStatusLed() {
  // Heartbeat pulse on top of state color.
  // CAN down => red blink. CAN ok + WiFi ok => green pulse. CAN ok + not WiFi => yellow pulse.
  unsigned long now = millis();
  bool wifiConnected = (WiFi.status() == WL_CONNECTED);

  uint8_t r = 0, g = 0, b = 0;
  if (SAFE_MODE) {
    r = 12; g = 0; b = 18; // purple-ish
  } else if (!CANOK) {
    r = 40; g = 0; b = 0;
  } else if (wifiConnected) {
    r = 0; g = 30; b = 0;
  } else {
    r = 25; g = 10; b = 0;
  }

  // Pulse / blink shaping
  if (!CANOK) {
    // 1 Hz red blink
    bool on = ((now % 1000UL) < 250UL);
    setStatusLed(on ? r : 0, on ? g : 0, on ? b : 0);
    return;
  }

  // Heartbeat: quick double-pulse each second.
  uint16_t t = (uint16_t)(now % 1000UL);
  uint8_t boost = 0;
  if (t < 60) boost = 35;
  else if (t >= 140 && t < 200) boost = 20;

  auto satAdd = [](uint8_t base, uint8_t add) -> uint8_t {
    uint16_t v = (uint16_t)base + (uint16_t)add;
    return (v > 255) ? 255 : (uint8_t)v;
  };

  setStatusLed(satAdd(r, boost), satAdd(g, boost), satAdd(b, boost));
}

static bool parseId(const String &s, unsigned long &outId) {
  if (s.length() == 0) return false;
  const char *c = s.c_str();
  char *endp = nullptr;
  unsigned long v = 0;
  if (s.startsWith("0x") || s.startsWith("0X")) v = strtoul(c + 2, &endp, 16);
  else v = strtoul(c, &endp, 0);
  if (endp == c) return false;
  outId = v;
  return true;
}

static bool parseHexBytes(const String &hex, byte *out, byte &outLen) {
  // Accept forms like: "01 02 0A FF" or "01020AFF" (spaces optional)
  outLen = 0;
  String s = hex;
  s.replace(" ", "");
  s.replace("\n", "");
  s.replace("\r", "");
  s.replace("\t", "");
  s.trim();
  if (s.length() == 0) { outLen = 0; return true; }
  if ((s.length() % 2) != 0) return false;

  byte n = (byte)min((int)(s.length() / 2), 8);
  for (byte i = 0; i < n; ++i) {
    char a = s.charAt(i * 2);
    char b = s.charAt(i * 2 + 1);
    auto val = [](char c) -> int {
      if (c >= '0' && c <= '9') return c - '0';
      if (c >= 'A' && c <= 'F') return c - 'A' + 10;
      if (c >= 'a' && c <= 'f') return c - 'a' + 10;
      return -1;
    };
    int va = val(a);
    int vb = val(b);
    if (va < 0 || vb < 0) return false;
    out[i] = (byte)((va << 4) | vb);
  }
  outLen = n;
  return true;
}

static void broadcastFramesBatch(uint32_t maxFrames) {
  if (webSocket.connectedClients() == 0) return;

  unsigned long total = min((unsigned long)MAX_FRAME_LIST, framesTotal);
  if (total == 0) return;

  uint32_t sendCount = min((unsigned long)maxFrames, total);

  // Build a compact JSON array: [{id:"0x123",data:"..",ts:123},...]
  // Manual string build is faster than allocating a DynamicJsonDocument at high rate.
  String out;
  out.reserve(sendCount * 64);
  out += '[';

  for (uint32_t i = 0; i < sendCount; ++i) {
    int idx = (framesHead - 1 - (int)i + MAX_FRAME_LIST) % MAX_FRAME_LIST;

    char idbuf[16];
    sprintf(idbuf, "0x%lX", framesBuf[idx].id);

    if (i) out += ',';
    out += "{\"id\":\"";
    out += idbuf;
    out += "\",\"data\":\"";
    out += framesBuf[idx].data;
    out += "\",\"ts\":";
    out += String(framesBuf[idx].ts);
    out += '}';
  }

  out += ']';
  wsBroadcast(out);
}

#if ENABLE_I2C_DISPLAY
static Adafruit_SSD1306 display(128, 32, &Wire, -1);
static bool DISPLAY_OK = false;
static unsigned long displayLastMs = 0;

static void updateDisplay() {
  if (!DISPLAY_OK) return;
  unsigned long now = millis();
  if (now - displayLastMs < 100) return; // ~10 Hz display refresh
  displayLastMs = now;

  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);

  display.setCursor(0, 0);
  display.print("CAN:"); display.print(CANOK ? "OK" : "NO");
  display.print("  WiFi:"); display.print((WiFi.status() == WL_CONNECTED) ? "OK" : "NO");

  // Line 2: buttons
  display.setCursor(0, 10);
  display.print("B1:"); display.print(inputStableActive[0] ? 1 : 0);
  display.print(" B2:"); display.print(inputStableActive[1] ? 1 : 0);
  display.print(" B3:"); display.print(inputStableActive[2] ? 1 : 0);

  // Line 3: switches + packed byte
  display.setCursor(0, 20);
  display.print("S1:"); display.print(inputStableActive[3] ? 1 : 0);
  display.print(" S2:"); display.print(inputStableActive[4] ? 1 : 0);
  display.print(" S3:"); display.print(inputStableActive[5] ? 1 : 0);
  display.print(" P1:");
  if (lastPort1 < 16) display.print('0');
  display.print(lastPort1, HEX);

