averyizatt/ESP32CanBusAutomotiveDataLogger/ESP32CanBus/ESP32S3_CANOnly/ESP32S3_CANOnly.ino
  display.display();
}
#endif

void setup() {
  Serial.begin(115200);
  delay(250);

#if HAS_USB_CDC
  // Bring up USB CDC at runtime so logs can appear on the USB port.
  USB.begin();
  delay(50);
#endif

  // Route debug output to UART Serial and USB CDC (if present)
  DBG.a = &Serial;
  DBG.b = nullptr;

  // WDT early so init phases are protected.
  initWdt();
  feedWdt();

  // Boot-loop detection: if we keep rebooting before reaching "stable" runtime,
  // increment a counter in RTC and enter SAFE_MODE.
  bootFailCount++;
  if (bootFailCount >= SAFE_MODE_BOOT_THRESHOLD) SAFE_MODE = true;

  esp_reset_reason_t rr = esp_reset_reason();

#if DEBUG_SERIAL_LEVEL > 0
  DBG.println();
  DBG.println("--- ESP32-S3 CAN-Only Boot ---");
  DBG.print("Reset reason: "); DBG.println(resetReasonStr(rr));
  DBG.print("bootFailCount: "); DBG.print((unsigned long)bootFailCount);
  DBG.print(" SAFE_MODE: "); DBG.println(SAFE_MODE ? "YES" : "NO");
  DBG.print("CPU MHz: "); DBG.println(getCpuFrequencyMhz());
  DBG.print("Chip rev: "); DBG.println((int)ESP.getChipRevision());
  DBG.print("SDK: "); DBG.println(ESP.getSdkVersion());
  DBG.print("Flash size: "); DBG.println((unsigned long)ESP.getFlashChipSize());
  DBG.print("Pins: SDA="); DBG.print(I2C_SDA);
  DBG.print(" SCL="); DBG.print(I2C_SCL);
  DBG.print(" INT="); DBG.print(CAN_INT);
  DBG.print(" SCK="); DBG.print(CAN_SCK);
  DBG.print(" MOSI="); DBG.print(CAN_MOSI);
  DBG.print(" MISO="); DBG.print(CAN_MISO);
  DBG.print(" CS="); DBG.println(CAN_CS);
  DBG.print("CAN: bitrate=500k, mcp_clock=8MHz, id="); DBG.println((int)MICRO_CAN_ID);
#endif

  // I2C (if you later add an OLED again)
  Wire.begin(I2C_SDA, I2C_SCL);
  Wire.setClock(400000);
  feedWdt();

#if ENABLE_I2C_DISPLAY
  // Common SSD1306 I2C address is 0x3C
  DISPLAY_OK = display.begin(SSD1306_SWITCHCAPVCC, 0x3C);
  if (!DISPLAY_OK) {
    // Some modules use 0x3D
    DISPLAY_OK = display.begin(SSD1306_SWITCHCAPVCC, 0x3D);
  }
  if (DISPLAY_OK) {
    display.clearDisplay();
    display.setTextSize(1);
    display.setTextColor(SSD1306_WHITE);
    display.setCursor(0, 0);
    display.println("ESP32-S3 CAN");
    display.println("Booting...");
    display.display();
  }
#endif

  setStatusLed(0, 0, 30); // boot blue

  // SPI for MCP2515
  pinMode(CAN_CS, OUTPUT);
  digitalWrite(CAN_CS, HIGH);
  SPI.begin(CAN_SCK, CAN_MISO, CAN_MOSI, CAN_CS);
  // Start conservative for bring-up; raise after CAN init succeeds.
  SPI.setFrequency(SPI_BAUD_INIT);

  // Quick SPI-level probe so we know if the chip is even responding.
  probeMcp2515Once();

  // SPIFFS
  DBG.println("Mounting SPIFFS...");
  if (!SPIFFS.begin(false)) {
    DBG.println("SPIFFS mount failed, trying format");
    if (!SPIFFS.begin(true)) {
      DBG.println("SPIFFS still failed");
    }
  }
  ensureWifiJsonExists();
  ensureAdminTokenExists();
  ensureEspNowPeersFileExists();
  feedWdt();

  // Load ESP-NOW peer allowlist (after SPIFFS is mounted)
  loadEspNowPeersFromSpiffs();

  // ESP-NOW (bring up early; works with STA/AP+STA)
  ESPNOW_OK = initEspNow();

#if ENABLE_SD_LOGGING
  // SD (logging only; web UI still served from SPIFFS)
  DBG.println("Starting SD...");
  pinMode(SD_CS, OUTPUT);
  digitalWrite(SD_CS, HIGH);

  SDOK = SD.begin(SD_CS, SPI);
  DBG.print("SD status: ");
  DBG.println(SDOK ? "OK" : "FAIL");

  if (SDOK) {
    startNewTrip();
    sdQueue = xQueueCreate(SD_QUEUE_SIZE, sizeof(char *));
    if (sdQueue) {
      xTaskCreate(sdWriterTask, "sdWriter", 4096, NULL, 1, NULL);
    }
  }
#endif

  // CAN
  DBG.println("Starting CAN...");
  CANOK = initCanController(true);
  if (CANOK) {
    SPI.setFrequency(SPI_BAUD_RUN);
  }
  pinMode(CAN_INT, INPUT);
  updateStatusLed();

  configureLogicalInputs();
  configureLogicalOutputs();

  // WiFi
  DBG.println("Connecting WiFi...");
  if (SAFE_MODE) {
    DBG.println("SAFE_MODE: AP-only (skipping STA connect)");
    startAPMode();
    WIFIOK = false;
  } else {
    if (connectSavedNetworks()) {
      WIFIOK = true;
    } else {
      startAPMode();
      WIFIOK = false;
    }
  }
  feedWdt();

  // Try to acquire SNTP time when STA connected (helps SD log folder names)
  if (WiFi.status() == WL_CONNECTED) {
    configTime(0, 0, "pool.ntp.org", "time.nist.gov");
    unsigned long tstart = millis();
    while (millis() - tstart < 2500) {
      time_t nowt = time(nullptr);
      if ((uint32_t)nowt > 1700000000UL) {
        timeValid = true;
        break;
      }
      feedWdt();
      delay(50);
    }
    if (timeValid) DBG.println("Time: SNTP OK");
    else DBG.println("Time: SNTP not set (yet)");
  }

#if DEBUG_SERIAL_LEVEL > 0
  if (WiFi.status() == WL_CONNECTED) {
    DBG.print("WiFi STA connected, IP: ");
    DBG.println(WiFi.localIP());
  } else {
    DBG.print("WiFi AP mode, IP: ");
    DBG.println(WiFi.softAPIP());
  }
  DBG.print("Web URL: ");
  DBG.println(webURL);
#endif

  // mDNS (optional)
  if (WiFi.status() == WL_CONNECTED) {
    if (MDNS.begin("can-expander")) {
      DBG.println("mDNS started: http://can-expander.local");
      webURL = String("http://can-expander.local");
    }
  }

  DBG.print("Web URL: ");
  DBG.println(webURL);

  // Web routes
  server.on("/", handleRoot);
  server.on("/addwifi", HTTP_GET, handleAddWiFi);
  server.on("/addwifi", HTTP_POST, handleAddWiFi);

  server.on("/update", HTTP_POST,
            []() {
              if (!checkAuth()) {
                server.send(401, "text/plain", "Unauthorized");
                return;
              }
              server.send(200, "text/plain", "OTA done, rebooting");
              delay(500);
              ESP.restart();
            },
            handleOTAUpload);

  server.on("/status.json", HTTP_GET, []() {
    StaticJsonDocument<384> doc;
    doc["safe_mode"] = SAFE_MODE;
    doc["boot_fail"] = (unsigned long)bootFailCount;
    doc["gps"] = "DISABLED";
    doc["sd"] = SDOK ? "OK" : "NO";
    doc["can"] = CANOK ? "OK" : "NO";
    doc["wifi"] = (WiFi.status() == WL_CONNECTED) ? "OK" : "NO";
    doc["frames"] = (unsigned long)canCount;
    doc["push"] = (unsigned long)inputPushCount;
    doc["p1"] = lastPort1;
    doc["p2"] = lastPort2;
    doc["p3"] = lastPort3;
    doc["push_rc"] = (int)lastInputPushRc;
      doc["t7_rx"] = (unsigned long)msTable7RxCount;
      doc["t7_off"] = (unsigned long)msTable7LastOffset;
    doc["espnow"] = ESPNOW_OK ? "OK" : "NO";
    doc["en_rx"] = (unsigned long)espnowRxCount;
    doc["en_drop_na"] = (unsigned long)espnowDropNotAllowed;
    doc["en_drop_bad"] = (unsigned long)espnowDropBadPacket;
    doc["en_fwd_ok"] = (unsigned long)espnowForwardOk;
    doc["en_fwd_fail"] = (unsigned long)espnowForwardFail;
    doc["en_last_ms"] = (unsigned long)espnowLastRxMs;
    doc["en_last_mac"] = macToString(espnowLastMac);
    doc["en_peers"] = (unsigned long)espnowAllowedCount;
    doc["mph"] = 0;
    doc["lat"] = 0.0;
    doc["lon"] = 0.0;
    doc["sats"] = 0;
    String out;
    serializeJson(doc, out);
    server.sendHeader("Access-Control-Allow-Origin", "*");
    server.send(200, "application/json", out);
  });

#if ENABLE_ESPNOW
  // ESP-NOW peer allowlist management
  // GET /espnow/peers
  // POST /espnow/peers/add?mac=AA:BB:CC:DD:EE:FF
  // POST /espnow/peers/del?mac=AA:BB:CC:DD:EE:FF
  server.on("/espnow/peers", HTTP_GET, []() {
    StaticJsonDocument<512> doc;
    doc["allow_all_if_empty"] = (ESPNOW_ALLOW_ALL_IF_EMPTY != 0);
    JsonArray arr = doc.createNestedArray("peers");
    for (size_t i = 0; i < espnowAllowedCount; ++i) arr.add(macToString(espnowAllowedMacs[i]));
    String out;
    serializeJson(doc, out);
    server.sendHeader("Access-Control-Allow-Origin", "*");
    server.send(200, "application/json", out);
  });

  server.on("/espnow/peers/add", HTTP_POST, []() {
    if (!checkAuth()) { server.send(401, "text/plain", "Unauthorized"); return; }
    if (!server.hasArg("mac")) { server.send(400, "text/plain", "mac required"); return; }
    uint8_t mac[6];
    if (!parseMacString(server.arg("mac"), mac)) { server.send(400, "text/plain", "bad mac"); return; }
    for (size_t i = 0; i < espnowAllowedCount; ++i) {
      if (macEquals(espnowAllowedMacs[i], mac)) { server.send(200, "text/plain", "exists"); return; }
    }
    if (espnowAllowedCount >= ESPNOW_MAX_PEERS) { server.send(400, "text/plain", "peer list full"); return; }
    memcpy(espnowAllowedMacs[espnowAllowedCount++], mac, 6);
    saveEspNowPeersToSpiffs();
    refreshEspNowPeersInDriver();
    server.send(200, "text/plain", "OK");
  });

