averyizatt/ESP32CanBusAutomotiveDataLogger/ESP32CanBus/ESP32S3_CANOnly/ESP32S3_CANOnly.ino
  server.on("/espnow/peers/del", HTTP_POST, []() {
    if (!checkAuth()) { server.send(401, "text/plain", "Unauthorized"); return; }
    if (!server.hasArg("mac")) { server.send(400, "text/plain", "mac required"); return; }
    uint8_t mac[6];
    if (!parseMacString(server.arg("mac"), mac)) { server.send(400, "text/plain", "bad mac"); return; }
    bool found = false;
    for (size_t i = 0; i < espnowAllowedCount; ++i) {
      if (macEquals(espnowAllowedMacs[i], mac)) {
        found = true;
        for (size_t j = i + 1; j < espnowAllowedCount; ++j) {
          memcpy(espnowAllowedMacs[j - 1], espnowAllowedMacs[j], 6);
        }
        espnowAllowedCount--;
        break;
      }
    }
    saveEspNowPeersToSpiffs();
    server.send(found ? 200 : 404, "text/plain", found ? "OK" : "not found");
  });
#endif

#if ENABLE_SD_LOGGING
  // SD log listing + downloading (mirrors the parent sketch behavior)
  server.on("/sd/list", HTTP_GET, []() {
    if (!SDOK || !SD.exists("/logs")) {
      server.sendHeader("Access-Control-Allow-Origin", "*");
      server.send(200, "text/plain", "");
      return;
    }
    String out;
    appendFilesInDir(String("/logs"), out);
    server.sendHeader("Access-Control-Allow-Origin", "*");
    server.send(200, "text/plain", out);
  });

  server.on("/sd/download", HTTP_GET, []() {
    if (!SDOK) { server.send(500, "text/plain", "SD not mounted"); return; }
    if (!server.hasArg("name")) { server.send(400, "text/plain", "name required"); return; }
    String name = server.arg("name");
    if (!name.startsWith("/")) name = "/" + name;
    if (!SD.exists(name)) { server.send(404, "text/plain", "not found"); return; }
    File f = SD.open(name, FILE_READ);
    if (!f) { server.send(500, "text/plain", "open failed"); return; }
    server.sendHeader("Access-Control-Allow-Origin", "*");
    server.streamFile(f, "application/octet-stream");
    f.close();
  });
#endif

  // Transmit a CAN frame (authenticated)
  // POST (or GET) /can/send?id=0x123&data=11223344&ext=0&token=...
  // data: up to 8 bytes hex, with or without spaces ("11 22 33 44" is ok)
  server.on("/can/send", HTTP_POST, []() {
    if (!checkAuth()) { server.send(401, "text/plain", "Unauthorized"); return; }
    if (!server.hasArg("id") || !server.hasArg("data")) { server.send(400, "text/plain", "id and data required"); return; }

    unsigned long id = 0;
    if (!parseId(server.arg("id"), id)) { server.send(400, "text/plain", "bad id"); return; }

    byte buf[8];
    byte len = 0;
    if (!parseHexBytes(server.arg("data"), buf, len)) { server.send(400, "text/plain", "bad data hex"); return; }

    bool ext = false;
    if (server.hasArg("ext")) {
      String e = server.arg("ext");
      ext = (e == "1" || e.equalsIgnoreCase("true") || e.equalsIgnoreCase("yes"));
    }

    byte rc = CAN_MICRO.sendMsgBuf(id, ext ? 1 : 0, len, buf);
    StaticJsonDocument<192> doc;
    doc["ok"] = (rc == CAN_OK);
    doc["rc"] = (int)rc;
    doc["id"] = String("0x") + String(id, HEX);
    doc["len"] = (int)len;
    String out; serializeJson(doc, out);
    server.sendHeader("Access-Control-Allow-Origin", "*");
    server.send((rc == CAN_OK) ? 200 : 500, "application/json", out);
  });

  server.on("/can/send", HTTP_GET, []() {
    // Convenience for quick testing from a browser/address bar
    if (!checkAuth()) { server.send(401, "text/plain", "Unauthorized"); return; }
    if (!server.hasArg("id") || !server.hasArg("data")) { server.send(400, "text/plain", "id and data required"); return; }

    unsigned long id = 0;
    if (!parseId(server.arg("id"), id)) { server.send(400, "text/plain", "bad id"); return; }

    byte buf[8];
    byte len = 0;
    if (!parseHexBytes(server.arg("data"), buf, len)) { server.send(400, "text/plain", "bad data hex"); return; }

    bool ext = false;
    if (server.hasArg("ext")) {
      String e = server.arg("ext");
      ext = (e == "1" || e.equalsIgnoreCase("true") || e.equalsIgnoreCase("yes"));
    }

    byte rc = CAN_MICRO.sendMsgBuf(id, ext ? 1 : 0, len, buf);
    server.sendHeader("Access-Control-Allow-Origin", "*");
    server.send((rc == CAN_OK) ? 200 : 500, "text/plain", (rc == CAN_OK) ? "OK" : "FAIL");
  });

  server.on("/frames", HTTP_GET, []() {
    DynamicJsonDocument doc(4096);
    JsonArray arr = doc.to<JsonArray>();
    unsigned long total = min((unsigned long)MAX_FRAME_LIST, framesTotal);
    for (unsigned long i = 0; i < total; ++i) {
      int idx = (framesHead - 1 - i + MAX_FRAME_LIST) % MAX_FRAME_LIST;
      JsonObject o = arr.createNestedObject();
      char idbuf[16];
      sprintf(idbuf, "0x%lX", framesBuf[idx].id);
      o["id"] = idbuf;
      o["data"] = framesBuf[idx].data;
      o["ts"] = framesBuf[idx].ts;
    }
    String out;
    serializeJson(doc, out);
    server.sendHeader("Access-Control-Allow-Origin", "*");
    server.send(200, "application/json", out);
  });

  server.on("/frames.txt", HTTP_GET, []() {
    String out;
    unsigned long total = min((unsigned long)MAX_FRAME_LIST, framesTotal);
    for (unsigned long i = 0; i < total; ++i) {
      int idx = (framesHead - 1 - i + MAX_FRAME_LIST) % MAX_FRAME_LIST;
      out += String("0x") + String(framesBuf[idx].id, HEX) + "|" + String(framesBuf[idx].data) + "|" + String(framesBuf[idx].ts) + "\n";
    }
    server.sendHeader("Access-Control-Allow-Origin", "*");
    server.send(200, "text/plain", out);
  });

  server.onNotFound(handleGenericFile);
  server.begin();
  DBG.println("HTTP server started");

  webSocket.begin();
  webSocket.onEvent(webSocketEvent);

  lastLoopRateSampleMs = millis();
  lastLoopCountSample = 0;
}

void loop() {
  feedWdt();
  server.handleClient();
  webSocket.loop();

  // Forward ESP-NOW packets onto CAN (done in main loop for safety).
  drainEspNowToCan();

  loopCount++;
  unsigned long now = millis();

  // Read/debounce user inputs frequently so OLED + CAN payloads are stable.
  pollUserInputs(now);

  if (now - lastLoopRateSampleMs >= 1000) {
    unsigned long delta = loopCount - lastLoopCountSample;
    loopRateHz = delta;
    lastLoopCountSample = loopCount;
    lastLoopRateSampleMs = now;
  }

