averyizatt/ESP32CanBusAutomotiveDataLogger/ESP32CanBus/ESP32S3_CANOnly/ESP32S3_CANOnly.ino
  // Drain CAN RX as fast as possible while INT is asserted.
  uint32_t drained = 0;
  while (!digitalRead(CAN_INT) && drained < CAN_DRAIN_MAX_PER_LOOP) {
    unsigned long id;
    byte len;
    byte buf[8];
    CAN_MICRO.readMsgBuf(&id, &len, buf);

    lastCanMsg = now;
    canCount++;
    drained++;
    wsFramesSincePush++;

    lastFrameId = id;
    lastFrameLen = len;
    lastFrameTs = now;

    pushFrame(id, buf, len);

  #if DEBUG_SERIAL_FRAMES
    dbgPrintCanFrame(id, len, buf);
  #endif

    // Observe Microsquirt table writes (for future outputs / debug)
    handleMicrosquirtTable7WriteFrame(id, len, buf);
  }

  drainedLastLoop = drained;

  // Push packed digital inputs into Microsquirt remote table at 20–50 Hz.
  // This is independent of receiving traffic.
  pushMicrosquirtInputsIfDue();

  // Recovery hooks (noise/EMI can wedge peripherals)
  maybeRecoverCan(now);
  maybeRecoverWifi(now);

  // If we have been stable for a while, clear the boot-loop counter so future resets
  // don't get stuck in SAFE_MODE unnecessarily.
  if (millis() > 60000) {
    bootFailCount = 0;
  }

  CANOK = (now - lastCanMsg < canTimeoutMs);
  updateStatusLed();

#if DEBUG_SERIAL_LEVEL > 0
  // WiFi state changes (rate-limited)
  if (now - dbgLastWifiStateMs >= 500) {
    dbgLastWifiStateMs = now;
    wl_status_t ws = WiFi.status();
    if (ws != dbgLastWifiStatus) {
      dbgLastWifiStatus = ws;
      DBG.print("WiFi status changed: ");
      DBG.println((int)ws);
      if (ws == WL_CONNECTED) {
        DBG.print("WiFi IP: ");
        DBG.println(WiFi.localIP());
      }
    }
  }

  if (CANOK != dbgLastCanOk) {
    dbgLastCanOk = CANOK;
    DBG.print("CANOK changed: ");
    DBG.println(CANOK ? "OK" : "NO");
  }

  // Periodic status (lots of useful debug, but not per-frame)
  const unsigned long statusInterval = (DEBUG_SERIAL_LEVEL >= 2) ? 500 : 1500;
  if (now - dbgLastStatusMs >= statusInterval) {
    dbgLastStatusMs = now;

    DBG.print("STAT ms="); DBG.print(now);
    DBG.print(" loopHz="); DBG.print((unsigned long)loopRateHz);
    DBG.print(" drained="); DBG.print((unsigned long)drainedLastLoop);
    DBG.print(" rx="); DBG.print((unsigned long)canCount);
    DBG.print(" push="); DBG.print((unsigned long)inputPushCount);
    DBG.print(" rc="); DBG.print((int)lastInputPushRc);
    DBG.print(" P=");
    dbgPrintHexByte((uint8_t)lastPort1); DBG.print(' ');
    dbgPrintHexByte((uint8_t)lastPort2); DBG.print(' ');
    dbgPrintHexByte((uint8_t)lastPort3);
    DBG.print(" lastId=0x"); DBG.print(lastFrameId, HEX);
    DBG.print(" lastAgeMs="); DBG.print((unsigned long)(now - lastFrameTs));
    DBG.print(" t7rx="); DBG.print((unsigned long)msTable7RxCount);
    DBG.print(" t7off="); DBG.print((unsigned long)msTable7LastOffset);
    DBG.println();
  }
#endif

#if ENABLE_I2C_DISPLAY
  updateDisplay();
#endif

  // Batch WebSocket pushes for higher throughput.
  if (webSocket.connectedClients() > 0 && (now - wsLastPushMs) >= WS_PUSH_INTERVAL_MS) {
    if (wsFramesSincePush > 0) {
      broadcastFramesBatch(WS_BATCH_MAX);
      wsFramesSincePush = 0;
    }
    wsLastPushMs = now;
  }
}
